app/controllers/posts_controller.rb

	def edit
		@post = Post.find_by_id(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]